# StairsStringersPresent Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsStringersPresent Property
ParameterTypeId Class See Also
---
"Stringer Position"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsStringersPresent { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsStringersPresent As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsStringersPresent {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace